ChibiOS/ChibiOS/os/hal/ports/STM32/STM32WBxx/hal_lld.h
#elif STM32_PPRE1 == STM32_PPRE1_DIV16
#define STM32_PCLK1                 (STM32_HCLK / 16)

#else
#error "invalid STM32_PPRE1 value specified"
#endif

/*
 * APB1 frequency check.
 */
#if STM32_PCLK1 > STM32_PCLK1_MAX
#error "STM32_PCLK1 exceeding maximum frequency (STM32_PCLK1_MAX)"
#endif

/**
 * @brief   APB2 frequency.
 */
#if (STM32_PPRE2 == STM32_PPRE2_DIV1) || defined(__DOXYGEN__)
#define STM32_PCLK2                 (STM32_HCLK / 1)

#elif STM32_PPRE2 == STM32_PPRE2_DIV2
#define STM32_PCLK2                 (STM32_HCLK / 2)

#elif STM32_PPRE2 == STM32_PPRE2_DIV4
#define STM32_PCLK2                 (STM32_HCLK / 4)

#elif STM32_PPRE2 == STM32_PPRE2_DIV8
#define STM32_PCLK2                 (STM32_HCLK / 8)

#elif STM32_PPRE2 == STM32_PPRE2_DIV16
#define STM32_PCLK2                 (STM32_HCLK / 16)

#else
#error "invalid STM32_PPRE2 value specified"
#endif

/*
 * APB2 frequency check.
 */
#if STM32_PCLK2 > STM32_PCLK2_MAX
#error "STM32_PCLK2 exceeding maximum frequency (STM32_PCLK2_MAX)"
#endif

/**
 * @brief   HCLK2 (CPU2) frequency.
 */
#if (STM32_C2HPRE == STM32_C2HPRE_DIV1) || defined(__DOXYGEN__)
#define STM32_HCLK2                 (STM32_SYSCLK / 1)

#elif STM32_C2HPRE == STM32_C2HPRE_DIV2
#define STM32_HCLK2                 (STM32_SYSCLK / 2)

#elif STM32_C2HPRE == STM32_C2HPRE_DIV3
#define STM32_HCLK2                 (STM32_SYSCLK / 3)

#elif STM32_C2HPRE == STM32_C2HPRE_DIV4
#define STM32_HCLK2                 (STM32_SYSCLK / 4)

#elif STM32_C2HPRE == STM32_C2HPRE_DIV5
#define STM32_HCLK2                 (STM32_SYSCLK / 5)

#elif STM32_C2HPRE == STM32_C2HPRE_DIV6
#define STM32_HCLK2                 (STM32_SYSCLK / 6)

#elif STM32_C2HPRE == STM32_C2HPRE_DIV8
#define STM32_HCLK2                 (STM32_SYSCLK / 8)

#elif STM32_C2HPRE == STM32_C2HPRE_DIV10
#define STM32_HCLK2                 (STM32_SYSCLK / 10)

#elif STM32_C2HPRE == STM32_C2HPRE_DIV16
#define STM32_HCLK2                 (STM32_SYSCLK / 16)

#elif STM32_C2HPRE == STM32_C2HPRE_DIV32
#define STM32_HCLK2                 (STM32_SYSCLK / 32)

#elif STM32_C2HPRE == STM32_C2HPRE_DIV64
#define STM32_HCLK2                 (STM32_SYSCLK / 64)

#elif STM32_C2HPRE == STM32_C2HPRE_DIV128
#define STM32_HCLK2                 (STM32_SYSCLK / 128)

#elif STM32_C2HPRE == STM32_C2HPRE_DIV256
#define STM32_HCLK2                 (STM32_SYSCLK / 256)

#elif STM32_C2HPRE == STM32_C2HPRE_DIV512
#define STM32_HCLK2                 (STM32_SYSCLK / 512)

#else
#error "invalid STM32_C2HPRE value specified"
#endif

/*
 * HCLK2 (CPU2) frequency check.
 */
#if STM32_HCLK2 > STM32_C2HPRE_MAX
#error "STM32_HCLK2 exceeding maximum frequency (STM32_C2HPRE_MAX)"
#endif

/**
 * @brief   AHB4 frequency.
 */
#if (STM32_SHDHPRE == STM32_SHDHPRE_DIV1) || defined(__DOXYGEN__)
#define STM32_HCLK4                 (STM32_SYSCLK / 1)

#elif STM32_SHDHPRE == STM32_SHDHPRE_DIV2
#define STM32_HCLK4                 (STM32_SYSCLK / 2)

#elif STM32_SHDHPRE == STM32_SHDHPRE_DIV3
#define STM32_HCLK4                 (STM32_SYSCLK / 3)

#elif STM32_SHDHPRE == STM32_SHDHPRE_DIV4
#define STM32_HCLK4                 (STM32_SYSCLK / 4)

#elif STM32_SHDHPRE == STM32_SHDHPRE_DIV5
#define STM32_HCLK4                 (STM32_SYSCLK / 5)

#elif STM32_SHDHPRE == STM32_SHDHPRE_DIV6
#define STM32_HCLK4                 (STM32_SYSCLK / 6)

#elif STM32_SHDHPRE == STM32_SHDHPRE_DIV8
#define STM32_HCLK4                 (STM32_SYSCLK / 8)

#elif STM32_SHDHPRE == STM32_SHDHPRE_DIV10
#define STM32_HCLK4                 (STM32_SYSCLK / 10)

#elif STM32_SHDHPRE == STM32_SHDHPRE_DIV16
#define STM32_HCLK4                 (STM32_SYSCLK / 16)

#elif STM32_SHDHPRE == STM32_SHDHPRE_DIV32
#define STM32_HCLK4                 (STM32_SYSCLK / 32)

#elif STM32_SHDHPRE == STM32_SHDHPRE_DIV64
#define STM32_HCLK4                 (STM32_SYSCLK / 64)

#elif STM32_SHDHPRE == STM32_SHDHPRE_DIV128
#define STM32_HCLK4                 (STM32_SYSCLK / 128)

#elif STM32_SHDHPRE == STM32_SHDHPRE_DIV256
#define STM32_HCLK4                 (STM32_SYSCLK / 256)

#elif STM32_SHDHPRE == STM32_SHDHPRE_DIV512
#define STM32_HCLK4                 (STM32_SYSCLK / 512)

#else
#error "invalid STM32_SHDHPRE value specified"
#endif

/*
 * PLLSAI1 enable check.
 */
#if (STM32_SAI1SEL == STM32_SAI1SEL_PLLSAI1) ||                             \
    (STM32_CLK48SEL == STM32_CLK48SEL_PLLSAI1) ||                           \
    (STM32_ADCSEL == STM32_ADCSEL_PLLSAI1) ||                               \
    defined(__DOXYGEN__)

#if STM32_PLLCLKIN == 0
#error "PLLSAI1 activation required but no PLL clock selected"
#endif

/**
 * @brief   PLLSAI1 activation flag.
 */
#define STM32_ACTIVATE_PLLSAI1      TRUE
#else
#define STM32_ACTIVATE_PLLSAI1      FALSE
#endif

/**
 * @brief   STM32_PLLSAI1N field.
 */
#if ((STM32_PLLSAI1N_VALUE >= 8) && (STM32_PLLSAI1N_VALUE <= 86)) ||        \
    defined(__DOXYGEN__)
#define STM32_PLLSAI1N               (STM32_PLLSAI1N_VALUE << 8)
#else
#error "invalid STM32_PLLSAI1N_VALUE value specified"
#endif

/**
 * @brief   STM32_PLLSAI1P field.
 */
#if ((STM32_PLLSAI1P_VALUE >= 2) && (STM32_PLLSAI1P_VALUE <= 32)) ||        \
    defined(__DOXYGEN__)
#define STM32_PLLSAI1P               ((STM32_PLLSAI1P_VALUE -1) << 17)
#else
#error "invalid STM32_PLLSAI1P_VALUE value specified"
#endif

/**
 * @brief   STM32_PLLSAI1Q field.
 */
#if ((STM32_PLLSAI1Q_VALUE >= 2) && (STM32_PLLSAI1Q_VALUE <= 8)) ||        \
    defined(__DOXYGEN__)
#define STM32_PLLSAI1Q               ((STM32_PLLSAI1Q_VALUE -1) << 25)
#else
#error "invalid STM32_PLLSAI1Q_VALUE value specified"
#endif

/**
 * @brief   STM32_PLLSAI1R field.
 */
#if ((STM32_PLLSAI1R_VALUE >= 2) && (STM32_PLLSAI1R_VALUE <= 8)) ||        \
    defined(__DOXYGEN__)
#define STM32_PLLSAI1R               ((STM32_PLLSAI1R_VALUE -1) << 29)
#else
#error "invalid STM32_PLLSAI1R_VALUE value specified"
#endif

/**
 * @brief   STM32_PLLSAI1PEN field.
 */
#if (STM32_SAI1SEL == STM32_SAI1SEL_PLLSAI1) ||                             \
    defined(__DOXYGEN__)
#define STM32_PLLSAI1PEN            (1 << 16)
#else
#define STM32_PLLSAI1PEN            (0 << 16)
#endif

/**
 * @brief   STM32_PLLSAI1QEN field.
 */
#if (STM32_CLK48SEL == STM32_CLK48SEL_PLLSAI1) || defined(__DOXYGEN__)
#define STM32_PLLSAI1QEN            (1 << 24)
#else
#define STM32_PLLSAI1QEN            (0 << 24)
#endif

/**
 * @brief   STM32_PLLSAI1REN field.
 */
#if (STM32_ADCSEL == STM32_ADCSEL_PLLSAI1) || defined(__DOXYGEN__)
#define STM32_PLLSAI1REN            (1 << 28)
#else
#define STM32_PLLSAI1REN            (0 << 28)
#endif

/**
 * @brief   PLLSAI1 VCO frequency.
 */
#define STM32_PLLSAI1VCO             (STM32_PLLCLKIN * STM32_PLLSAI1N_VALUE)

